## Idiomatic Python

In [16]:
list1 = [27,31,45,34,66]
for i in range(len(list1) -1, -1, -1):
    print(list1[i]),

66 34 45 31 27

In [18]:
for i in reversed(list1):
    print(i),

66 34 45 31 27

In [20]:
for i,j in enumerate(list1):
    print("Index: {0} Value: {1}\n".format(i,j))

Index: 0 Value: 27

Index: 1 Value: 31

Index: 2 Value: 45

Index: 3 Value: 34

Index: 4 Value: 66

In [25]:
for i in sorted(list1):
    print(i),
    
print("\n")
    
for i in sorted(list1, reverse=True):
    print(i),

27 31 34 45 66

66 45 34 31 27

In [27]:
dict1 = {"Vikas": 60, "Vidya": 59, "Jeet": 66}
for i in dict1:
    if(i.startswith("V")):
        print(i)

Vikas
Vidya

In [33]:
print(sum(i**2 for i in range(10)))

285

In [44]:
li = [i**2 for i in range(100) if i % 2 == 0]
print(li)

[0, 4, 16, 36, 64, 100, 144, 196, 256, 324, 400, 484, 576, 676, 784, 900, 1024, 1156, 1296, 1444, 1600, 1764, 1936, 2116, 2304, 2500, 2704, 2916, 3136, 3364, 3600, 3844, 4096, 4356, 4624, 4900, 5184, 5476, 5776, 6084, 6400, 6724, 7056, 7396, 7744, 8100, 8464, 8836, 9216, 9604]

## Lambda Functions

In [46]:
a = lambda x : x**2
print(a(10))

100

## Lambda with filter()

In [52]:
li = range(10)
lam_li = filter(lambda x : x % 2 == 0, li)
print(lam_li)

[0, 2, 4, 6, 8]

## Lambda with map()

In [62]:
li = range(10)
map_list = map(lambda x : x % 2 == 0, li)
print(map_list)

[True, False, True, False, True, False, True, False, True, False]

## Lambda with reduce()

In [54]:
li = range(10)
sum = 0
for i in li:
    sum = sum + i
print(sum)

45

In [57]:
from functools import reduce

In [68]:
li = range(10)
reduce_list = reduce((lambda x, y: x + y), li)
print(reduce_list)

45

## Standard Packages

In [72]:
import pandas as pd
internal1 = {"s1": 10, "s2" : 20, "s3" : 30}
internal2 = {"s1" : 90, "s2" : 80, "s3" : 70}
internal1 = pd.Series(internal1)
internal2 = pd.Series(internal2)
df = pd.DataFrame({"internal1" : internal1, "internal2" : internal2})
print(df)

    internal1  internal2
s1         10         90
s2         20         80
s3         30         70

In [74]:
df.columns

Index([u'internal1', u'internal2'], dtype='object')

In [75]:
df.values

array([[10, 90],
       [20, 80],
       [30, 70]], dtype=int64)

In [76]:
df.values[2]

array([30, 70], dtype=int64)

In [78]:
df.values[2][0] = 100
df

    internal1  internal2
s1         10         90
s2         20         80
s3        100         70

In [83]:
df.loc["s4"] = [45, 76]
df

    internal1  internal2
s1         10         90
s2         20         80
s3        100         70
s4         45         76

In [90]:
data = pd.read_csv("Income.csv")

In [91]:
data

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [109]:
data[['State','2013']]

        State   2013
0     Alabama  41381
1      Alaska  61137
2     Arizona  50602
3    Arkansas  39919
4  California  57528

In [181]:
#Average income of California
for i in range(data.shape[0]):
    if(data.values[i][1] == "California"):
        list1 = data.iloc[i]["2005":"2013"].values
        print(list1.mean())

55350

In [157]:
data.value_count

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [177]:
data.max()

GEOID     04000US06
State    California
2005          55891
2006          56418
2007          62993
2008          63989
2009          61604
2010          57848
2011          57431
2012          63648
2013          61137
dtype: object

In [179]:
data["2005"].max()

55891

In [185]:
data.loc[:1]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137

In [193]:
data.sort_values('2005')

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137

In [206]:
data[(data["2005"] > 40000) & (data["2005"] < 50000)]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602

In [207]:
list(map(lambda x : x** -1, [1,2,3]))

[1.0, 0.5, 0.3333333333333333]

In [217]:
list(map((lambda x:x**2), range(10)))

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]